"""Test Data."""

# NOTES:
# - all dates are assumed to be at midnight

TEST_DATA = [
    # pre-Gregorian Calendar
    {
        'CE': '1700-01-01',
        'JU': '1699-12-22',
        'BE': '2243-01-01',
        'CS': None,
        'JDN': 2341972.5,
        'PKN_SHORT': None,
        'PKN_LONG': None,
        'NOTES': '',
    },
    {
        'CE': '1736-01-28',
        'JU': '1736-01-17',
        'BE': '2279-01-28',
        'CS': None,
        'JDN': 2355147.5,
        'PKN_SHORT': '1-1-1-1-1:1',
        'PKN_LONG': 'มหาสัมพยุหะ 1 จุลพยุหะ 1 มหาสมุหะ 1 จุลวรรค 1 มหาปักข์ ' +
                    '1 แรม 1 ค่ำ (ปักข์ถ้วน)',
        'NOTES': 'PKN epoch',
    },

    # Post-Gregorian switchover
    {
        'CE': '1757-01-01',
        'JU': '1756-12-21',
        'BE': '2300-01-01',
        'CS': None,
        'JDN': 2362791.5,
        'PKN_SHORT': '1-6-2-3-3:11',
        'PKN_LONG': 'มหาสัมพยุหะ 1 จุลพยุหะ 6 มหาสมุหะ 2 จุลวรรค 3 มหาปักข์ ' +
                    '3 ขึ้น 11 ค่ำ (ปักข์ถ้วน)',
        'NOTES': '',
    },
    {
        'CE': '1857-01-01',
        'JU': '1856-12-20',
        'BE': '2400-01-01',
        'CS': None,
        'JDN': 2399315.5,
        'PKN_SHORT': '3-9-2-1-1:6',
        'PKN_LONG': 'มหาสัมพยุหะ 3 จุลพยุหะ 9 มหาสมุหะ 2 จุลวรรค 1 มหาปักข์ ' +
                    '1 ขึ้น 6 ค่ำ (ปักข์ถ้วน)',
        'NOTES': '',
    },
    {
        'CE': '1944-02-09',
        'JU': '1944-01-27',
        'BE': '2487-02-09',
        'CS': None,
        'JDN': 2431129.5,
        'PKN_SHORT': '5-8-5-4-1:1',
        'PKN_LONG': 'มหาสัมพยุหะ 5 จุลพยุหะ 8 มหาสมุหะ 5 มหาวรรค 4 มหาปักข์ ' +
                    '1 แรม 1 ค่ำ (ปักข์ถ้วน)',
        'NOTES': '',
    },
    {
        'CE': '1957-01-01',
        'JU': '1956-12-19',
        'BE': '2500-01-01',
        'CS': None,
        'JDN': 2435839.5,
        'PKN_SHORT': '5-11-7-1-3:15',
        'PKN_LONG': 'มหาสัมพยุหะ 5 มหาพยุหะ 11 จุลสมุหะ 7 จุลวรรค ' +
                    '1 มหาปักข์ 3 แรม 15 ค่ำ (ปักข์ถ้วน)',
        'NOTES': '',
    },
    {
        'CE': '1970-01-01',
        'JU': '1969-12-19',
        'BE': '2513-01-01',
        'CS': None,
        'JDN': 2440587.5,
        'PKN_SHORT': '6-4-2-1-1:9',
        'PKN_LONG': 'มหาสัมพยุหะ 6 จุลพยุหะ 4 มหาสมุหะ 2 จุลวรรค 1 มหาปักข์ ' +
                    '1 แรม 9 ค่ำ (ปักข์ถ้วน)',
        'NOTES': 'UNIX/POSIX epoch',
    },
    {
        'CE': '1976-07-18',
        'JU': '1976-07-05',
        'BE': '2519-07-18',
        'CS': None,
        'JDN': 2442977.5,
        'PKN_SHORT': '6-5-5-4-2:7',
        'PKN_LONG': 'มหาสัมพยุหะ 6 จุลพยุหะ 5 มหาสมุหะ 5 มหาวรรค 4 มหาปักข์ ' +
                    '2 แรม 7 ค่ำ (ปักข์ถ้วน)',
        'NOTES': '',
    },
    {
        'CE': '2008-01-01',
        'JU': '2007-12-19',
        'BE': '2551-01-01',
        'CS': None,
        'JDN': 2454466.5,
        'PKN_SHORT': '7-2-4-2-4:8',
        'PKN_LONG': 'มหาสัมพยุหะ 7 จุลพยุหะ 2 มหาสมุหะ 4 จุลวรรค 2 จุลปักข์ ' +
                    '4 แรม 8 ค่ำ (ปักข์ขาด)',
        'NOTES': '',
    },
    {
        'CE': '2013-12-26',
        'JU': '2013-12-13',
        'BE': '2556-12-26',
        'CS': None,
        'JDN': 2456652.5,
        'PKN_SHORT': '7-4-1-3-3:9',
        'PKN_LONG': 'มหาสัมพยุหะ 7 จุลพยุหะ 4 มหาสมุหะ 1 จุลวรรค 3 มหาปักข์ ' +
                    '3 แรม 9 ค่ำ (ปักข์ถ้วน)',
        'NOTES': '',
    },
    {
        'CE': '2017-01-01',
        'JU': '2016-12-19',
        'BE': '2560-01-01',
        'CS': None,
        'JDN': 2457754.5,
        'PKN_SHORT': '7-4-6-1-1:4',
        'PKN_LONG': 'มหาสัมพยุหะ 7 จุลพยุหะ 4 จุลสมุหะ 6 จุลวรรค 1 มหาปักข์ ' +
                    '1 ขึ้น 4 ค่ำ (ปักข์ถ้วน)',
        'NOTES': '',
    },
]
